app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.slogs.any? %>
---
SELECT  1 AS one FROM "slogs"  WHERE "slogs"."user_id" = $1 LIMIT 1  [["user_id", 5]]