app/controllers/messages_controller.rb

  def new
    # just to display the form

    @user = User.find(params[:user])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1