app/controllers/registrations_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    hash = session[:omniauth]
    if hash
      @user = User.new(name: hash['info']['name'],
                       uid: hash['uid'],
                       provider: hash['provider'],
                       email: params[:user][:email],
                       password: Devise.friendly_token[0,20])
      # raise @user.email.to_s
      respond_to do |format|
        if @user.save