app/controllers/slogs_controller.rb

SELECT  "slogs".* FROM "slogs"   ORDER BY "slogs"."created_at" DESC LIMIT 30 OFFSET 0
---
    def index
      @slogs = Slog.paginate(page: params[:page])

INSERT INTO "slogs" ("created_at", "departure_date", "description", "poster", "slog_type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @slog = current_user.slogs.build(slog_params)
      @slog.poster = current_user.name

      respond_to do |format|
        if @slog.save