app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "slogs".* FROM "slogs"  WHERE "slogs"."user_id" = $1  ORDER BY "slogs"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 5]]
SELECT COUNT(*) FROM "slogs"  WHERE "slogs"."user_id" = $1  [["user_id", 5]]
---
  def show
    @user = User.find(params[:id])
    @slogs = @user.slogs.paginate(page: params[:page])